Repository: kodcast/velorution_connector
Catalog: locales/*/LC_MESSAGES/djheros_connector.po
Languages: de, es, fr, it, pl, pt

source: 🔄 Loading djheros_connector plugin...
de: 🔄 djheros_connector Plugin wird geladen...
es: 🔄 Cargando el plugin djheros_connector...
fr: 🔄 Chargement du plugin djheros_connector...
it: 🔄 Caricamento del plugin djheros_connector...
pl: 🔄 Ładowanie wtyczki djheros_connector...
pt: 🔄 Carregando o plugin djheros_connector...

source: 🔔 Plugin djheros_connector loaded.
de: 🔔 djheros_connector Plugin geladen.
es: 🔔 Plugin djheros_connector cargado.
fr: 🔔 Plugin djheros_connector chargé.
it: 🔔 Plugin djheros_connector caricato.
pl: 🔔 Wtyczka djheros_connector załadowana.
pt: 🔔 Plugin djheros_connector carregado.

source: 🔧 Creating main window...
de: 🔧 Erstelle Hauptfenster...
es: 🔧 Creando ventana principal...
fr: 🔧 Création de la fenêtre principale...
it: 🔧 Creazione della finestra principale...
pl: 🔧 Tworzenie głównego okna...
pt: 🔧 Criando a janela principal...

source: enter the adress (ex: https://yourdjherosplace.com/) :
de: Geben Sie die Adresse ein (z.B.: https://yourdjherosplace.com/) :
es: Ingrese la dirección (ej: https://yourdjherosplace.com/) :
fr: Entrez l'adresse (ex: https://yourdjherosplace.com/) :
it: Inserisci l'indirizzo (es: https://yourdjherosplace.com/) :
pl: Wprowadź adres (np.: https://yourdjherosplace.com/) :
pt: Digite o endereço (ex: https://yourdjherosplace.com/) :

source: URL de base
de: Basis-URL
es: URL base
it: URL di base
pl: Podstawowy URL
pt: URL base

source: Audio Format:
es: Formato de audio:
fr: Format audio :
it: Formato audio:
pl: Format audio:
pt: Formato de áudio:

source: Audio Quality:
de: Audioqualität:
es: Calidad de audio:
fr: Qualité audio :
it: Qualità audio:
pl: Jakość audio:
pt: Qualidade de áudio:

source: Search and Download
de: Suchen und Herunterladen
es: Buscar y Descargar
fr: Rechercher et Télécharger
it: Cerca e Scarica
pl: Szukaj i Pobieraj
pt: Buscar e Baixar

source: Stop
de: Stopp
es: Detener
fr: Arrêter
it: Interrompi
pl: Zatrzymaj
pt: Parar

source: Pause
es: Pausa
it: Pausa
pl: Pauza
pt: Pausar

source: Search paused by user.
de: Suche vom Benutzer pausiert.
es: Búsqueda pausada por el usuario.
fr: Recherche mise en pause par l'utilisateur.
it: Ricerca messa in pausa dall'utente.
pl: Wyszukiwanie wstrzymane przez użytkownika.
pt: Busca pausada pelo usuário.

source: Search resumed.
de: Suche fortgesetzt.
es: Búsqueda reanudada.
fr: Recherche reprise.
it: Ricerca ripresa.
pl: Wyszukiwanie wznowione.
pt: Busca retomada.

source: Search stopped by user.
de: Suche vom Benutzer gestoppt.
es: Búsqueda detenida por el usuario.
fr: Recherche arrêtée par l'utilisateur.
it: Ricerca interrotta dall'utente.
pl: Wyszukiwanie zatrzymane przez użytkownika.
pt: Busca interrompida pelo usuário.

source: No URL provided.
de: Keine URL angegeben.
es: No se proporcionó URL.
fr: Aucune URL fournie.
it: Nessun URL fornito.
pl: Nie podano URL.
pt: Nenhuma URL fornecida.

source: Please enter a valid URL.
de: Bitte geben Sie eine gültige URL ein.
es: Por favor, ingrese una URL válida.
fr: Veuillez entrer une URL valide.
it: Per favore inserisci un URL valido.
pl: Proszę podać prawidłowy URL.
pt: Por favor, insira uma URL válida.

source: 📡 Fetching propositions from {url}
de: 📡 Hole Vorschläge von {url}
es: 📡 Obteniendo propuestas desde {url}
fr: 📡 Récupération des propositions depuis {url}
it: 📡 Recupero proposte da {url}
pl: 📡 Pobieranie propozycji z {url}
pt: 📡 Buscando propostas de {url}

source: ❌ Error fetching or parsing JSON: {error}
de: ❌ Fehler beim Abrufen oder Parsen von JSON: {error}
es: ❌ Error al obtener o analizar el JSON: {error}
fr: ❌ Erreur lors de la récupération ou de l'analyse du JSON : {error}
it: ❌ Errore nel recupero o nell'analisi del JSON: {error}
pl: ❌ Błąd pobierania lub analizowania JSON: {error}
pt: ❌ Erro ao buscar ou analisar JSON: {error}

source: ⚠️ No validated propositions found.
de: ⚠️ Keine validierten Vorschläge gefunden.
es: ⚠️ No se encontraron propuestas validadas.
fr: ⚠️ Aucune proposition validée trouvée.
it: ⚠️ Nessuna proposta validata trovata.
pl: ⚠️ Nie znaleziono zatwierdzonych propozycji.
pt: ⚠️ Nenhuma proposta validada encontrada.

source: 🔍 Starting searches for {count} proposition(s)
de: 🔍 Starte Suche nach {count} Vorschlag(en)
es: 🔍 Iniciando búsqueda de {count} propuesta(s)
fr: 🔍 Lancement des recherches pour {count} proposition(s)
it: 🔍 Avvio della ricerca per {count} proposta(e)
pl: 🔍 Rozpoczynanie wyszukiwania dla {count} propozycji(i)
pt: 🔍 Iniciando buscas para {count} proposta(s)

source: 📡 Searching for: {term}
de: 📡 Suche nach: {term}
es: 📡 Buscando: {term}
fr: 📡 Recherche : {term}
it: 📡 Ricerca: {term}
pl: 📡 Szukanie: {term}
pt: 📡 Buscando por: {term}

source: ❌ Error during search for '{term}': {error}
de: ❌ Fehler bei der Suche nach '{term}': {error}
es: ❌ Error durante la búsqueda de '{term}': {error}
fr: ❌ Erreur lors de la recherche de '{term}' : {error}
it: ❌ Errore durante la ricerca di '{term}': {error}
pl: ❌ Błąd podczas wyszukiwania '{term}': {error}
pt: ❌ Erro durante a busca por '{term}': {error}

source: ❌ No matching file found for {term}
de: ❌ Keine passende Datei für {term} gefunden
es: ❌ No se encontró un archivo que coincida para {term}
fr: ❌ Aucun fichier correspondant trouvé pour {term}
it: ❌ Nessun file corrispondente trovato per {term}
pl: ❌ Nie znaleziono pasującego pliku dla {term}
pt: ❌ Nenhum arquivo correspondente encontrado para {term}

source: 📩 Received search results...
de: 📩 Suchergebnisse empfangen...
es: 📩 Resultados de búsqueda recibidos...
fr: 📩 Résultats de recherche reçus...
it: 📩 Risultati della ricerca ricevuti...
pl: 📩 Odebrane wyniki wyszukiwania...
pt: 📩 Resultados de busca recebidos...

source: 🎯 Checking file: {filename} (Format: {h_format}, Quality: {h_quality}, Format match: {format_match}, Quality match: {quality_match}, private: {is_private})
de: 🎯 Überprüfe Datei: {filename} (Format: {h_format}, Qualität: {h_quality}, Format stimmt: {format_match}, Qualität stimmt: {quality_match}, privat: {is_private})
es: 🎯 Comprobando archivo: {filename} (Formato: {h_format}, Calidad: {h_quality}, Formato coincide: {format_match}, Calidad coincide: {quality_match}, privado: {is_private})
fr: 🎯 Vérification du fichier : {filename} (Format : {h_format}, Qualité : {h_quality}, Format correspond : {format_match}, Qualité correspond : {quality_match}, privé : {is_private})
it: 🎯 Verifica del file: {filename} (Formato: {h_format}, Qualità: {h_quality}, Formato corrisponde: {format_match}, Qualità corrisponde: {quality_match}, privato: {is_private})
pl: 🎯 Sprawdzanie pliku: {filename} (Format: {h_format}, Jakość: {h_quality}, Zgodność formatu: {format_match}, Zgodność jakości: {quality_match}, prywatny: {is_private})
pt: 🎯 Verificando arquivo: {filename} (Formato: {h_format}, Qualidade: {h_quality}, Formato compatível: {format_match}, Qualidade compatível: {quality_match}, privado: {is_private})

source: ✅ Matching result found for {term}: {filename}
de: ✅ Passendes Ergebnis gefunden für {term}: {filename}
es: ✅ Resultado coincidente encontrado para {term}: {filename}
fr: ✅ Résultat correspondant trouvé pour {term} : {filename}
it: ✅ Risultato corrispondente trovato per {term}: {filename}
pl: ✅ Znaleziono pasujący wynik dla {term}: {filename}
pt: ✅ Resultado correspondente encontrado para {term}: {filename}

source: 🚀 Download launched for: {file}
de: 🚀 Download gestartet für: {file}
es: 🚀 Descarga iniciada para: {file}
fr: 🚀 Téléchargement lancé pour : {file}
it: 🚀 Download avviato per: {file}
pl: 🚀 Rozpoczęto pobieranie pliku: {file}
pt: 🚀 Download iniciado para: {file}

source: ❌ Error downloading {file}: {error}
de: ❌ Fehler beim Download von {file}: {error}
es: ❌ Error al descargar {file}: {error}
fr: ❌ Erreur lors du téléchargement de {file} : {error}
it: ❌ Errore nel download di {file}: {error}
pl: ❌ Błąd pobierania {file}: {error}
pt: ❌ Erro ao baixar {file}: {error}

source: ❌ Window closed.
de: ❌ Fenster geschlossen.
es: ❌ Ventana cerrada.
fr: ❌ Fenêtre fermée.
it: ❌ Finestra chiusa.
pl: ❌ Okno zamknięte.
pt: ❌ Janela fechada.
